byAlex_regularPorousMedia-master/twoPhase/compressible/RmaxRmin/src/system/createPatchDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:                                        |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      createPatchDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

pointSync false;

patches
(
    {
        name cyclicInlet;

        patchInfo
        {
            type patch;
        }

        constructFrom patches;

        patches (inlet);
    }
    {
        name cyclicOutlet;

        patchInfo
        {
            type patch;
        }

        constructFrom patches;

        patches (outlet);
    }
);

// ************************************************************************* //
