byAlex_regularPorousMedia-master/twoPhase/compressible/RmaxRmin/src/constant/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases (phase1 phase2);

pMin                pMin                [ 1 -1 -2 0 0 0 0 ] 1000;

sigma               sigma               [ 1 0 -2 0 0 0 0 ]  0.072;

// sigma
// {
//     type    liquidProperties;
//     phase   liquid;
// }

channelLength       channelLength       [0 1 0 0 0 0 0]     0;

// ************************************************************************* //
