byAlex_regularPorousMedia-master/twoPhase/compressible/RmaxRmin/src/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1e5;

boundaryField
{
    wedge_1
    {
        type            wedge;
    }

    wedge_2
    {
        type            wedge;
    }

    channelWall
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }

    cyclicInlet
    {
        type            uniformJumpAMI;
        patchType       cyclicAMI;
        jumpTable       constant -30;
    }

    cyclicOutlet
    {
        type            uniformJumpAMI;
        patchType       cyclicAMI;
    }

    defaultFaces
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
