byAlex_regularPorousMedia-master/twoPhase/compressible/RmaxRmin/src/0/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 293;

boundaryField
{
    wedge_1
    {
        type            wedge;
    }

    wedge_2
    {
        type            wedge;
    }

    channelWall
    {
        type            fixedValue;
        value           uniform 293;
    }

    cyclicInlet
    {
        type            cyclicAMI;
    }

    cyclicOutlet
    {
        type            cyclicAMI;
    }

    defaultFaces
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
