byAlex_regularPorousMedia-master/twoPhase/compressible/RmaxRmin/src/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
    //default         CrankNicolson 0.2;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    div(phi,alpha)                      Gauss vanLeer;
    div(phirb,alpha)                    Gauss vanLeer;

    //div(rhoPhi,U)                       Gauss limitedCubic 1;
    div(rhoPhi,U)                       Gauss upwind;
    div(phi,thermo:rho.phase1)          Gauss upwind;
    div(phi,thermo:rho.phase2)          Gauss upwind;
    div(rhoPhi,T)                       Gauss upwind;
    div(rhoPhi,K)                       Gauss upwind;
    div(phi,p)                          Gauss upwind;
    div(phi,k)                          Gauss upwind;
    div(phid1,p_rgh)                    Gauss upwind;
    div(phid2,p_rgh)                    Gauss upwind;

    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}

fluxRequired
{
    default         no;
    p_rgh;
    pcorr;
}


// ************************************************************************* //
