byAlex_regularPorousMedia-master/twoPhase/compressible/RmaxRmin/src/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.phase1    0
);

regions
(
    sphereToCell
    {
        centre                  (0 0 0); 
        radius                  0;
        fieldValues
        (
            volScalarFieldValue alpha.phase1    1
        );
    }
);


// ************************************************************************* //
