byAlex_regularPorousMedia-master/twoPhase/compressible/RmaxRmin/src/system/snappyHexMeshSrc/refinementSurfaces_list
channelWall    {level (1 1); patchInfo{type wall;}}
