byAlex_regularPorousMedia-master/twoPhase/compressible/RmaxRmin/src/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:                                        |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    AMI1;
        type    faceSet;
        action  new;
        source  patchToFace;
        sourceInfo
        {
            name "cyclicInlet";
        }
    }
    {
        name    AMI2;
        type    faceSet;
        action  new;
        source  patchToFace;
        sourceInfo
        {
            name "cyclicOutlet";
        }
    }
);

// ************************************************************************* //
